[    
    //"Retrieve all annotated proteins from an Influenza A virus genome.",
    "Identify mutations in the hemagglutinin gene of H1N1 isolates.",
    "Find all known antiviral resistance mutations in a Hepatitis C virus genome.",
    //"Retrieve all structural proteins of a SARS-CoV-2 isolate.",
    "Compare spike protein variants between multiple SARS-CoV-2 genomes.",
    "Identify recombination events in Dengue virus genomes.",
    "Retrieve all non-structural proteins of Zika virus.",
    "Identify conserved epitopes in Ebola virus glycoproteins.",
    "Detect potential zoonotic transmission events in Rabies virus genomes.",
    "Find all accessory proteins in MERS-CoV genomes.",
    
    "Identify bacterial secretion system genes in a Legionella pneumophila genome.",
    "Retrieve all effector proteins secreted by a Salmonella enterica strain.",
    "Find host receptors targeted by Listeria monocytogenes invasion proteins.",
    "Identify bacterial adhesins in a Neisseria meningitidis genome.",
    "Retrieve all toxin-antitoxin system genes in a Mycobacterium tuberculosis genome.",
    "Find all genes involved in intracellular survival of Brucella abortus.",
    "Identify host immune evasion genes in a Yersinia pestis genome.",
    "Retrieve all genes involved in iron uptake in a pathogenic Vibrio vulnificus strain.",
    "Find phage-encoded virulence factors in a Staphylococcus aureus genome.",
    "Identify bacterial genes that mimic host proteins in a Chlamydia trachomatis genome.",
    
    "Identify all integrons present in a Pseudomonas aeruginosa genome.",
    "Retrieve all transposase genes in a multidrug-resistant Acinetobacter baumannii isolate.",
    "Find prophage regions in a Vibrio cholerae genome.",
    "Identify conjugative plasmid genes in a hospital-acquired Enterobacter cloacae strain.",
    "Retrieve insertion sequence elements in a newly sequenced Shigella flexneri genome.",
    "Find all genomic islands in a Klebsiella pneumoniae isolate.",
    "Identify CRISPR arrays in a Lactococcus lactis genome.",
    "Retrieve phage defense-associated genes in a Streptococcus pyogenes isolate.",

    //"Retrieve the annotated features of a Salmonella enterica genome.",
    "Get all coding sequences (CDS) for a Pseudomonas aeruginosa genome.",
    "Find all pseudogenes in a Mycobacterium tuberculosis strain.",
    "Extract all ribosomal RNA (rRNA) genes from a Vibrio cholerae genome.",
    "List all tRNA genes in a Klebsiella pneumoniae genome.",
    //"Retrieve all virulence factors in a clinical Escherichia coli isolate.",
    "Find all phage-associated genes in a Listeria monocytogenes genome.",
    "Retrieve all hypothetical proteins in a recently sequenced Bacillus subtilis genome.",
    "Extract all protein sequences from a Clostridium difficile strain.",
    "Get all gene ontology (GO) terms associated with proteins in a Yersinia pestis genome.",
    
    "Identify orthologous genes between Escherichia coli and Shigella flexneri.",
    "Retrieve paralogous genes in a Streptococcus pneumoniae genome.",
    "Compare metabolic pathways between two Helicobacter pylori strains.",
    "Find genes that are unique to a pathogenic Acinetobacter baumannii strain compared to a commensal strain.",
    "List all genes in a Vibrio parahaemolyticus genome that have no homologs in other Vibrio species.",
    "Retrieve all single nucleotide polymorphisms (SNPs) between two Neisseria gonorrhoeae isolates.",
    "Find gene fusions in a recently sequenced Burkholderia pseudomallei strain.",
    "Identify antibiotic resistance genes present in a hospital-acquired Enterobacter cloacae isolate but absent in an environmental isolate.",
    "Retrieve all plasmid-encoded genes from a Salmonella Typhimurium genome.",
    "Identify genomic islands in a newly sequenced Campylobacter jejuni strain.",
    
    "Retrieve all publicly available genomes for Salmonella enterica for phylogenetic analysis.",
    "Construct a phylogenetic tree for 20 Klebsiella pneumoniae strains.",
    "Find SNPs unique to multidrug-resistant Staphylococcus aureus strains.",
    "Identify gene duplications in a Mycobacterium tuberculosis genome.",
    "Retrieve all core genes of Escherichia coli strains.",
    "Find strain-specific genes in a Listeria monocytogenes outbreak strain.",
    "Extract allelic variants of the gyrA gene across multiple Pseudomonas aeruginosa genomes.",
    "Retrieve historical isolates of Yersinia pestis for a time-scaled phylogeny.",
    "Identify transposon-mediated gene disruptions in a Clostridioides difficile genome.",
    "Retrieve all genomes from environmental Vibrio strains for evolutionary analysis.",

    "Identify bacterial species present in a gut microbiome sample.",
    "Find antimicrobial resistance genes in a wastewater microbiome sample.",
    "Determine the relative abundance of Bacteroides species in a human fecal sample.",
    "Identify viruses present in a marine microbiome dataset.",
    "Compare the taxonomic composition of two soil microbiome samples.",
    "Detect horizontal gene transfer events in a metagenome assembly.",
    "Identify functional pathways enriched in a gut microbiome sample.",
    "Retrieve all antibiotic resistance genes detected in a hospital ICU microbiome.",
    "Compare microbial diversity between healthy and diseased lung microbiomes.",
    //"Detect plasmid-associated genes in a sewage metagenomic dataset.",
    
    "Identify all beta-lactamase genes in a carbapenem-resistant Enterobacter cloacae isolate.",
    "Retrieve known aminoglycoside resistance genes in a clinical Pseudomonas aeruginosa strain.",
    "Find mutations in the gyrA and parC genes associated with fluoroquinolone resistance in Neisseria gonorrhoeae.",
    //"Determine if a Salmonella strain carries mobile colistin resistance (mcr) genes.",
    "Identify multidrug efflux pump genes in a hospital-acquired Klebsiella pneumoniae isolate.",
    "Compare aminoglycoside resistance determinants between two Acinetobacter baumannii strains.",
    "Retrieve all carbapenemase genes found in Escherichia coli clinical isolates.",
    "Identify point mutations in the rpoB gene associated with rifampin resistance in Mycobacterium tuberculosis.",
    "Find plasmid-mediated quinolone resistance genes in a Shigella flexneri isolate.",
    "Detect novel antimicrobial resistance determinants in a newly sequenced Staphylococcus epidermidis genome.",
    
    "Identify all genes involved in the TCA cycle in a Pseudomonas putida genome.",
    "Retrieve all genes encoding nitrogen fixation proteins in a Bradyrhizobium japonicum strain.",
    "Find all genes related to butanol biosynthesis in Clostridium acetobutylicum.",
    "Identify genes involved in quorum sensing in a Vibrio harveyi isolate.",
    "Retrieve all genes involved in sulfur metabolism in a Desulfovibrio vulgaris genome.",
    "Find biosynthetic gene clusters responsible for polyketide production in an Actinomyces strain.",
    "Identify key enzymes in the glycolysis pathway of a Lactobacillus plantarum strain.",
    "Compare amino acid biosynthesis pathways between Corynebacterium glutamicum and Escherichia coli.",
    "Retrieve all transporters involved in iron acquisition in a Yersinia pestis genome.",
    "Identify genes associated with ethanol tolerance in Saccharomyces cerevisiae."
]

